espressif/esp-idf/components/soc/esp32p4/include/soc/gpio_struct.h
/** Type of status1_w1ts register
 *  GPIO interrupt status set register for GPIO32-56
 */
typedef union {
    struct {
        /** status1_w1ts : WT; bitpos: [24:0]; default: 0;
         *  GPIO interrupt status set register for GPIO32-56
         */
        uint32_t status1_w1ts:25;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} gpio_status1_w1ts_reg_t;

/** Type of status1_w1tc register
 *  GPIO interrupt status clear register for GPIO32-56
 */
typedef union {
    struct {
        /** status1_w1tc : WT; bitpos: [24:0]; default: 0;
         *  GPIO interrupt status clear register for GPIO32-56
         */
        uint32_t status1_w1tc:25;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} gpio_status1_w1tc_reg_t;

/** Type of intr_0 register
 *  GPIO interrupt 0 status register for GPIO0-31
 */
typedef union {
    struct {
        /** int_0 : RO; bitpos: [31:0]; default: 0;
         *  GPIO interrupt 0 status register for GPIO0-31
         */
        uint32_t int_0:32;
    };
    uint32_t val;
} gpio_intr_0_reg_t;

/** Type of intr1_0 register
 *  GPIO interrupt 0 status register for GPIO32-56
 */
typedef union {
    struct {
        /** int1_0 : RO; bitpos: [24:0]; default: 0;
         *  GPIO interrupt 0 status register for GPIO32-56
         */
        uint32_t int1_0:25;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} gpio_intr1_0_reg_t;

/** Type of intr_1 register
 *  GPIO interrupt 1 status register for GPIO0-31
 */
typedef union {
    struct {
        /** int_1 : RO; bitpos: [31:0]; default: 0;
         *  GPIO interrupt 1 status register for GPIO0-31
         */
        uint32_t int_1:32;
    };
    uint32_t val;
} gpio_intr_1_reg_t;

/** Type of intr1_1 register
 *  GPIO interrupt 1 status register for GPIO32-56
 */
typedef union {
    struct {
        /** int1_1 : RO; bitpos: [24:0]; default: 0;
         *  GPIO interrupt 1 status register for GPIO32-56
         */
        uint32_t int1_1:25;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} gpio_intr1_1_reg_t;

/** Type of status_next register
 *  GPIO interrupt source register for GPIO0-31
 */
typedef union {
    struct {
        /** status_interrupt_next : RO; bitpos: [31:0]; default: 0;
         *  GPIO interrupt source register for GPIO0-31
         */
        uint32_t status_interrupt_next:32;
    };
    uint32_t val;
} gpio_status_next_reg_t;

/** Type of status_next1 register
 *  GPIO interrupt source register for GPIO32-56
 */
typedef union {
    struct {
        /** status_interrupt_next1 : RO; bitpos: [24:0]; default: 0;
         *  GPIO interrupt source register for GPIO32-56
         */
        uint32_t status_interrupt_next1:25;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} gpio_status_next1_reg_t;

/** Type of pinn register
 *  GPIO pin configuration register
 */
typedef union {
    struct {
        /** pinn_sync2_bypass : R/W; bitpos: [1:0]; default: 0;
         *  set GPIO input_sync2 signal mode. 0:disable. 1:trigger at negedge. 2or3:trigger at
         *  posedge.
         */
        uint32_t pinn_sync2_bypass:2;
        /** pinn_pad_driver : R/W; bitpos: [2]; default: 0;
         *  set this bit to select pad driver. 1:open-drain. 0:normal.
         */
        uint32_t pinn_pad_driver:1;
        /** pinn_sync1_bypass : R/W; bitpos: [4:3]; default: 0;
         *  set GPIO input_sync1 signal mode. 0:disable. 1:trigger at negedge. 2or3:trigger at
         *  posedge.
         */
        uint32_t pinn_sync1_bypass:2;
        uint32_t reserved_5:2;
        /** pinn_int_type : R/W; bitpos: [9:7]; default: 0;
         *  set this value to choose interrupt mode. 0:disable GPIO interrupt. 1:trigger at
         *  posedge. 2:trigger at negedge. 3:trigger at any edge. 4:valid at low level. 5:valid
         *  at high level
         */
        uint32_t pinn_int_type:3;
        /** pinn_wakeup_enable : R/W; bitpos: [10]; default: 0;
         *  set this bit to enable GPIO wakeup.(can only wakeup CPU from Light-sleep Mode)
         */
        uint32_t pinn_wakeup_enable:1;
        /** pinn_config : R/W; bitpos: [12:11]; default: 0;
         *  reserved
         */
        uint32_t pinn_config:2;
        /** pinn_int_ena : R/W; bitpos: [17:13]; default: 0;
         *  set bit 13 to enable CPU interrupt. set bit 14 to enable CPU(not shielded)
         *  interrupt.
         */
        uint32_t pinn_int_ena:5;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} gpio_pinn_reg_t;

/** Type of func1_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func1_in_sel : R/W; bitpos: [5:0]; default: 63;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func1_in_sel:6;
        /** func1_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func1_in_inv_sel:1;
        /** sig1_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig1_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func1_in_sel_cfg_reg_t;

/** Type of func2_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func2_in_sel : R/W; bitpos: [5:0]; default: 63;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func2_in_sel:6;
        /** func2_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func2_in_inv_sel:1;
        /** sig2_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig2_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func2_in_sel_cfg_reg_t;

/** Type of func3_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func3_in_sel : R/W; bitpos: [5:0]; default: 63;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func3_in_sel:6;
        /** func3_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func3_in_inv_sel:1;
        /** sig3_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig3_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func3_in_sel_cfg_reg_t;

/** Type of func4_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func4_in_sel : R/W; bitpos: [5:0]; default: 63;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func4_in_sel:6;
        /** func4_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func4_in_inv_sel:1;
        /** sig4_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig4_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func4_in_sel_cfg_reg_t;

