espressif/esp-idf/components/soc/esp32p4/include/soc/gpio_struct.h
/** Type of func13_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func13_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func13_in_sel:6;
        /** func13_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func13_in_inv_sel:1;
        /** sig13_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig13_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func13_in_sel_cfg_reg_t;

/** Type of func14_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func14_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func14_in_sel:6;
        /** func14_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func14_in_inv_sel:1;
        /** sig14_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig14_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func14_in_sel_cfg_reg_t;

/** Type of func15_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func15_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func15_in_sel:6;
        /** func15_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func15_in_inv_sel:1;
        /** sig15_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig15_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func15_in_sel_cfg_reg_t;

/** Type of func16_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func16_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func16_in_sel:6;
        /** func16_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func16_in_inv_sel:1;
        /** sig16_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig16_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func16_in_sel_cfg_reg_t;

/** Type of func17_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func17_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func17_in_sel:6;
        /** func17_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func17_in_inv_sel:1;
        /** sig17_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig17_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func17_in_sel_cfg_reg_t;

/** Type of func18_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func18_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func18_in_sel:6;
        /** func18_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func18_in_inv_sel:1;
        /** sig18_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig18_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func18_in_sel_cfg_reg_t;

/** Type of func19_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func19_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func19_in_sel:6;
        /** func19_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func19_in_inv_sel:1;
        /** sig19_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig19_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func19_in_sel_cfg_reg_t;

/** Type of func20_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func20_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func20_in_sel:6;
        /** func20_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func20_in_inv_sel:1;
        /** sig20_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig20_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func20_in_sel_cfg_reg_t;

/** Type of func21_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func21_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func21_in_sel:6;
        /** func21_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func21_in_inv_sel:1;
        /** sig21_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig21_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func21_in_sel_cfg_reg_t;

/** Type of func22_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func22_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func22_in_sel:6;
        /** func22_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func22_in_inv_sel:1;
        /** sig22_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig22_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func22_in_sel_cfg_reg_t;

