espressif/esp-idf/components/soc/esp32p4/include/soc/gpio_struct.h
/** Type of func23_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func23_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func23_in_sel:6;
        /** func23_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func23_in_inv_sel:1;
        /** sig23_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig23_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func23_in_sel_cfg_reg_t;

/** Type of func24_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func24_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func24_in_sel:6;
        /** func24_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func24_in_inv_sel:1;
        /** sig24_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig24_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func24_in_sel_cfg_reg_t;

/** Type of func25_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func25_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func25_in_sel:6;
        /** func25_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func25_in_inv_sel:1;
        /** sig25_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig25_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func25_in_sel_cfg_reg_t;

/** Type of func26_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func26_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func26_in_sel:6;
        /** func26_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func26_in_inv_sel:1;
        /** sig26_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig26_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func26_in_sel_cfg_reg_t;

/** Type of func27_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func27_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func27_in_sel:6;
        /** func27_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func27_in_inv_sel:1;
        /** sig27_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig27_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func27_in_sel_cfg_reg_t;

/** Type of func28_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func28_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func28_in_sel:6;
        /** func28_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func28_in_inv_sel:1;
        /** sig28_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig28_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func28_in_sel_cfg_reg_t;

/** Type of func29_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func29_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func29_in_sel:6;
        /** func29_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func29_in_inv_sel:1;
        /** sig29_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig29_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func29_in_sel_cfg_reg_t;

/** Type of func30_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func30_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func30_in_sel:6;
        /** func30_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func30_in_inv_sel:1;
        /** sig30_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig30_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func30_in_sel_cfg_reg_t;

/** Type of func31_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func31_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func31_in_sel:6;
        /** func31_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func31_in_inv_sel:1;
        /** sig31_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig31_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func31_in_sel_cfg_reg_t;

/** Type of func32_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func32_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func32_in_sel:6;
        /** func32_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func32_in_inv_sel:1;
        /** sig32_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig32_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func32_in_sel_cfg_reg_t;

