espressif/esp-idf/components/soc/esp32p4/include/soc/gpio_struct.h
/** Type of func33_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func33_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func33_in_sel:6;
        /** func33_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func33_in_inv_sel:1;
        /** sig33_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig33_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func33_in_sel_cfg_reg_t;

/** Type of func34_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func34_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func34_in_sel:6;
        /** func34_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func34_in_inv_sel:1;
        /** sig34_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig34_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func34_in_sel_cfg_reg_t;

/** Type of func35_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func35_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func35_in_sel:6;
        /** func35_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func35_in_inv_sel:1;
        /** sig35_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig35_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func35_in_sel_cfg_reg_t;

/** Type of func36_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func36_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func36_in_sel:6;
        /** func36_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func36_in_inv_sel:1;
        /** sig36_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig36_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func36_in_sel_cfg_reg_t;

/** Type of func37_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func37_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func37_in_sel:6;
        /** func37_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func37_in_inv_sel:1;
        /** sig37_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig37_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func37_in_sel_cfg_reg_t;

/** Type of func38_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func38_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func38_in_sel:6;
        /** func38_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func38_in_inv_sel:1;
        /** sig38_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig38_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func38_in_sel_cfg_reg_t;

/** Type of func39_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func39_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func39_in_sel:6;
        /** func39_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func39_in_inv_sel:1;
        /** sig39_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig39_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func39_in_sel_cfg_reg_t;

/** Type of func40_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func40_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func40_in_sel:6;
        /** func40_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func40_in_inv_sel:1;
        /** sig40_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig40_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func40_in_sel_cfg_reg_t;

/** Type of func41_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func41_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func41_in_sel:6;
        /** func41_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func41_in_inv_sel:1;
        /** sig41_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig41_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func41_in_sel_cfg_reg_t;

/** Type of func42_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func42_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func42_in_sel:6;
        /** func42_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func42_in_inv_sel:1;
        /** sig42_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig42_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func42_in_sel_cfg_reg_t;

