espressif/esp-idf/components/soc/esp32p4/include/soc/gpio_struct.h
/** Type of func43_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func43_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func43_in_sel:6;
        /** func43_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func43_in_inv_sel:1;
        /** sig43_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig43_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func43_in_sel_cfg_reg_t;

/** Type of func44_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func44_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func44_in_sel:6;
        /** func44_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func44_in_inv_sel:1;
        /** sig44_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig44_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func44_in_sel_cfg_reg_t;

/** Type of func45_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func45_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func45_in_sel:6;
        /** func45_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func45_in_inv_sel:1;
        /** sig45_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig45_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func45_in_sel_cfg_reg_t;

/** Type of func47_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func47_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func47_in_sel:6;
        /** func47_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func47_in_inv_sel:1;
        /** sig47_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig47_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func47_in_sel_cfg_reg_t;

/** Type of func48_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func48_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func48_in_sel:6;
        /** func48_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func48_in_inv_sel:1;
        /** sig48_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig48_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func48_in_sel_cfg_reg_t;

/** Type of func49_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func49_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func49_in_sel:6;
        /** func49_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func49_in_inv_sel:1;
        /** sig49_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig49_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func49_in_sel_cfg_reg_t;

/** Type of func50_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func50_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func50_in_sel:6;
        /** func50_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func50_in_inv_sel:1;
        /** sig50_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig50_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func50_in_sel_cfg_reg_t;

/** Type of func51_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func51_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func51_in_sel:6;
        /** func51_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func51_in_inv_sel:1;
        /** sig51_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig51_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func51_in_sel_cfg_reg_t;

/** Type of func52_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func52_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func52_in_sel:6;
        /** func52_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func52_in_inv_sel:1;
        /** sig52_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig52_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func52_in_sel_cfg_reg_t;

