espressif/esp-idf/components/soc/esp32p4/include/soc/gpio_struct.h
/** Type of func53_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func53_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func53_in_sel:6;
        /** func53_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func53_in_inv_sel:1;
        /** sig53_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig53_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func53_in_sel_cfg_reg_t;

/** Type of func54_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func54_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func54_in_sel:6;
        /** func54_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func54_in_inv_sel:1;
        /** sig54_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig54_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func54_in_sel_cfg_reg_t;

/** Type of func55_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func55_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func55_in_sel:6;
        /** func55_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func55_in_inv_sel:1;
        /** sig55_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig55_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func55_in_sel_cfg_reg_t;

/** Type of func56_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func56_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func56_in_sel:6;
        /** func56_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func56_in_inv_sel:1;
        /** sig56_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig56_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func56_in_sel_cfg_reg_t;

/** Type of func57_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func57_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func57_in_sel:6;
        /** func57_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func57_in_inv_sel:1;
        /** sig57_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig57_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func57_in_sel_cfg_reg_t;

/** Type of func58_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func58_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func58_in_sel:6;
        /** func58_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func58_in_inv_sel:1;
        /** sig58_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig58_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func58_in_sel_cfg_reg_t;

/** Type of func59_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func59_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func59_in_sel:6;
        /** func59_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func59_in_inv_sel:1;
        /** sig59_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig59_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func59_in_sel_cfg_reg_t;

/** Type of func60_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func60_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func60_in_sel:6;
        /** func60_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func60_in_inv_sel:1;
        /** sig60_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig60_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func60_in_sel_cfg_reg_t;

/** Type of func61_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func61_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func61_in_sel:6;
        /** func61_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func61_in_inv_sel:1;
        /** sig61_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig61_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func61_in_sel_cfg_reg_t;

/** Type of func62_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func62_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func62_in_sel:6;
        /** func62_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func62_in_inv_sel:1;
        /** sig62_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig62_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func62_in_sel_cfg_reg_t;

