espressif/esp-idf/components/soc/esp32p4/include/soc/gpio_struct.h
/** Type of func74_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func74_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func74_in_sel:6;
        /** func74_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func74_in_inv_sel:1;
        /** sig74_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig74_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func74_in_sel_cfg_reg_t;

/** Type of func75_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func75_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func75_in_sel:6;
        /** func75_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func75_in_inv_sel:1;
        /** sig75_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig75_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func75_in_sel_cfg_reg_t;

/** Type of func76_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func76_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func76_in_sel:6;
        /** func76_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func76_in_inv_sel:1;
        /** sig76_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig76_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func76_in_sel_cfg_reg_t;

/** Type of func77_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func77_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func77_in_sel:6;
        /** func77_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func77_in_inv_sel:1;
        /** sig77_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig77_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func77_in_sel_cfg_reg_t;

/** Type of func78_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func78_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func78_in_sel:6;
        /** func78_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func78_in_inv_sel:1;
        /** sig78_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig78_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func78_in_sel_cfg_reg_t;

/** Type of func80_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func80_in_sel : R/W; bitpos: [5:0]; default: 63;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func80_in_sel:6;
        /** func80_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func80_in_inv_sel:1;
        /** sig80_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig80_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func80_in_sel_cfg_reg_t;

/** Type of func83_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func83_in_sel : R/W; bitpos: [5:0]; default: 63;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func83_in_sel:6;
        /** func83_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func83_in_inv_sel:1;
        /** sig83_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig83_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func83_in_sel_cfg_reg_t;

/** Type of func86_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func86_in_sel : R/W; bitpos: [5:0]; default: 63;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func86_in_sel:6;
        /** func86_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func86_in_inv_sel:1;
        /** sig86_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig86_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func86_in_sel_cfg_reg_t;

/** Type of func89_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func89_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func89_in_sel:6;
        /** func89_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func89_in_inv_sel:1;
        /** sig89_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig89_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func89_in_sel_cfg_reg_t;

/** Type of func90_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func90_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func90_in_sel:6;
        /** func90_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func90_in_inv_sel:1;
        /** sig90_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig90_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func90_in_sel_cfg_reg_t;

/** Type of func91_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func91_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func91_in_sel:6;
        /** func91_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func91_in_inv_sel:1;
        /** sig91_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig91_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func91_in_sel_cfg_reg_t;

/** Type of func92_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func92_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func92_in_sel:6;
        /** func92_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func92_in_inv_sel:1;
        /** sig92_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig92_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func92_in_sel_cfg_reg_t;

