espressif/esp-idf/components/soc/esp32p4/include/soc/gpio_struct.h
/** Type of func102_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func102_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func102_in_sel:6;
        /** func102_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func102_in_inv_sel:1;
        /** sig102_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig102_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func102_in_sel_cfg_reg_t;

/** Type of func103_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func103_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func103_in_sel:6;
        /** func103_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func103_in_inv_sel:1;
        /** sig103_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig103_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func103_in_sel_cfg_reg_t;

/** Type of func104_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func104_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func104_in_sel:6;
        /** func104_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func104_in_inv_sel:1;
        /** sig104_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig104_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func104_in_sel_cfg_reg_t;

/** Type of func105_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func105_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func105_in_sel:6;
        /** func105_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func105_in_inv_sel:1;
        /** sig105_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig105_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func105_in_sel_cfg_reg_t;

/** Type of func106_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func106_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func106_in_sel:6;
        /** func106_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func106_in_inv_sel:1;
        /** sig106_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig106_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func106_in_sel_cfg_reg_t;

/** Type of func107_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func107_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func107_in_sel:6;
        /** func107_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func107_in_inv_sel:1;
        /** sig107_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig107_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func107_in_sel_cfg_reg_t;

/** Type of func108_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func108_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func108_in_sel:6;
        /** func108_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func108_in_inv_sel:1;
        /** sig108_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig108_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func108_in_sel_cfg_reg_t;

/** Type of func109_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func109_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func109_in_sel:6;
        /** func109_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func109_in_inv_sel:1;
        /** sig109_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig109_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func109_in_sel_cfg_reg_t;

/** Type of func110_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func110_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func110_in_sel:6;
        /** func110_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func110_in_inv_sel:1;
        /** sig110_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig110_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func110_in_sel_cfg_reg_t;

/** Type of func111_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func111_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func111_in_sel:6;
        /** func111_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func111_in_inv_sel:1;
        /** sig111_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig111_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func111_in_sel_cfg_reg_t;

