espressif/esp-idf/components/soc/esp32p4/include/soc/gpio_struct.h
/** Type of func112_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func112_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func112_in_sel:6;
        /** func112_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func112_in_inv_sel:1;
        /** sig112_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig112_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func112_in_sel_cfg_reg_t;

/** Type of func113_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func113_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func113_in_sel:6;
        /** func113_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func113_in_inv_sel:1;
        /** sig113_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig113_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func113_in_sel_cfg_reg_t;

/** Type of func114_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func114_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func114_in_sel:6;
        /** func114_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func114_in_inv_sel:1;
        /** sig114_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig114_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func114_in_sel_cfg_reg_t;

/** Type of func117_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func117_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func117_in_sel:6;
        /** func117_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func117_in_inv_sel:1;
        /** sig117_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig117_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func117_in_sel_cfg_reg_t;

/** Type of func118_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func118_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func118_in_sel:6;
        /** func118_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func118_in_inv_sel:1;
        /** sig118_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig118_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func118_in_sel_cfg_reg_t;

/** Type of func126_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func126_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func126_in_sel:6;
        /** func126_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func126_in_inv_sel:1;
        /** sig126_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig126_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func126_in_sel_cfg_reg_t;

/** Type of func127_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func127_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func127_in_sel:6;
        /** func127_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func127_in_inv_sel:1;
        /** sig127_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig127_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func127_in_sel_cfg_reg_t;

/** Type of func128_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func128_in_sel : R/W; bitpos: [5:0]; default: 63;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func128_in_sel:6;
        /** func128_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func128_in_inv_sel:1;
        /** sig128_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig128_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func128_in_sel_cfg_reg_t;

/** Type of func129_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func129_in_sel : R/W; bitpos: [5:0]; default: 63;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func129_in_sel:6;
        /** func129_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func129_in_inv_sel:1;
        /** sig129_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig129_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func129_in_sel_cfg_reg_t;

/** Type of func130_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func130_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func130_in_sel:6;
        /** func130_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func130_in_inv_sel:1;
        /** sig130_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig130_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func130_in_sel_cfg_reg_t;

/** Type of func131_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func131_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func131_in_sel:6;
        /** func131_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func131_in_inv_sel:1;
        /** sig131_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig131_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func131_in_sel_cfg_reg_t;

