espressif/esp-idf/components/soc/esp32p4/include/soc/gpio_struct.h
/** Type of func132_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func132_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func132_in_sel:6;
        /** func132_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func132_in_inv_sel:1;
        /** sig132_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig132_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func132_in_sel_cfg_reg_t;

/** Type of func133_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func133_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func133_in_sel:6;
        /** func133_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func133_in_inv_sel:1;
        /** sig133_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig133_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func133_in_sel_cfg_reg_t;

/** Type of func134_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func134_in_sel : R/W; bitpos: [5:0]; default: 63;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func134_in_sel:6;
        /** func134_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func134_in_inv_sel:1;
        /** sig134_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig134_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func134_in_sel_cfg_reg_t;

/** Type of func135_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func135_in_sel : R/W; bitpos: [5:0]; default: 63;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func135_in_sel:6;
        /** func135_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func135_in_inv_sel:1;
        /** sig135_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig135_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func135_in_sel_cfg_reg_t;

/** Type of func136_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func136_in_sel : R/W; bitpos: [5:0]; default: 63;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func136_in_sel:6;
        /** func136_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func136_in_inv_sel:1;
        /** sig136_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig136_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func136_in_sel_cfg_reg_t;

/** Type of func137_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func137_in_sel : R/W; bitpos: [5:0]; default: 63;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func137_in_sel:6;
        /** func137_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func137_in_inv_sel:1;
        /** sig137_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig137_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func137_in_sel_cfg_reg_t;

/** Type of func138_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func138_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func138_in_sel:6;
        /** func138_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func138_in_inv_sel:1;
        /** sig138_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig138_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func138_in_sel_cfg_reg_t;

/** Type of func139_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func139_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func139_in_sel:6;
        /** func139_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func139_in_inv_sel:1;
        /** sig139_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig139_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func139_in_sel_cfg_reg_t;

/** Type of func140_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func140_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func140_in_sel:6;
        /** func140_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func140_in_inv_sel:1;
        /** sig140_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig140_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func140_in_sel_cfg_reg_t;

/** Type of func141_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func141_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func141_in_sel:6;
        /** func141_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func141_in_inv_sel:1;
        /** sig141_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig141_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func141_in_sel_cfg_reg_t;

