espressif/esp-idf/components/soc/esp32p4/include/soc/gpio_struct.h
/** Type of func142_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func142_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func142_in_sel:6;
        /** func142_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func142_in_inv_sel:1;
        /** sig142_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig142_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func142_in_sel_cfg_reg_t;

/** Type of func143_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func143_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func143_in_sel:6;
        /** func143_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func143_in_inv_sel:1;
        /** sig143_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig143_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func143_in_sel_cfg_reg_t;

/** Type of func144_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func144_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func144_in_sel:6;
        /** func144_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func144_in_inv_sel:1;
        /** sig144_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig144_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func144_in_sel_cfg_reg_t;

/** Type of func145_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func145_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func145_in_sel:6;
        /** func145_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func145_in_inv_sel:1;
        /** sig145_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig145_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func145_in_sel_cfg_reg_t;

/** Type of func146_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func146_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func146_in_sel:6;
        /** func146_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func146_in_inv_sel:1;
        /** sig146_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig146_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func146_in_sel_cfg_reg_t;

/** Type of func147_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func147_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func147_in_sel:6;
        /** func147_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func147_in_inv_sel:1;
        /** sig147_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig147_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func147_in_sel_cfg_reg_t;

/** Type of func148_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func148_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func148_in_sel:6;
        /** func148_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func148_in_inv_sel:1;
        /** sig148_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig148_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func148_in_sel_cfg_reg_t;

/** Type of func149_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func149_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func149_in_sel:6;
        /** func149_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func149_in_inv_sel:1;
        /** sig149_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig149_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func149_in_sel_cfg_reg_t;

/** Type of func150_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func150_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func150_in_sel:6;
        /** func150_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func150_in_inv_sel:1;
        /** sig150_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig150_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func150_in_sel_cfg_reg_t;

/** Type of func151_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func151_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func151_in_sel:6;
        /** func151_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func151_in_inv_sel:1;
        /** sig151_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig151_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func151_in_sel_cfg_reg_t;

