espressif/esp-idf/components/soc/esp32p4/include/soc/gpio_struct.h
/** Type of func152_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func152_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func152_in_sel:6;
        /** func152_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func152_in_inv_sel:1;
        /** sig152_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig152_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func152_in_sel_cfg_reg_t;

/** Type of func153_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func153_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func153_in_sel:6;
        /** func153_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func153_in_inv_sel:1;
        /** sig153_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig153_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func153_in_sel_cfg_reg_t;

/** Type of func154_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func154_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func154_in_sel:6;
        /** func154_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func154_in_inv_sel:1;
        /** sig154_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig154_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func154_in_sel_cfg_reg_t;

/** Type of func155_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func155_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func155_in_sel:6;
        /** func155_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func155_in_inv_sel:1;
        /** sig155_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig155_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func155_in_sel_cfg_reg_t;

/** Type of func156_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func156_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func156_in_sel:6;
        /** func156_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func156_in_inv_sel:1;
        /** sig156_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig156_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func156_in_sel_cfg_reg_t;

/** Type of func158_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func158_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func158_in_sel:6;
        /** func158_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func158_in_inv_sel:1;
        /** sig158_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig158_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func158_in_sel_cfg_reg_t;

/** Type of func159_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func159_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func159_in_sel:6;
        /** func159_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func159_in_inv_sel:1;
        /** sig159_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig159_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func159_in_sel_cfg_reg_t;

/** Type of func160_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func160_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func160_in_sel:6;
        /** func160_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func160_in_inv_sel:1;
        /** sig160_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig160_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func160_in_sel_cfg_reg_t;

/** Type of func161_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func161_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func161_in_sel:6;
        /** func161_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func161_in_inv_sel:1;
        /** sig161_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig161_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func161_in_sel_cfg_reg_t;

