espressif/esp-idf/components/soc/esp32p4/include/soc/gpio_struct.h
/** Type of func162_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func162_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func162_in_sel:6;
        /** func162_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func162_in_inv_sel:1;
        /** sig162_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig162_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func162_in_sel_cfg_reg_t;

/** Type of func163_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func163_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func163_in_sel:6;
        /** func163_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func163_in_inv_sel:1;
        /** sig163_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig163_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func163_in_sel_cfg_reg_t;

/** Type of func164_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func164_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func164_in_sel:6;
        /** func164_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func164_in_inv_sel:1;
        /** sig164_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig164_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func164_in_sel_cfg_reg_t;

/** Type of func165_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func165_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func165_in_sel:6;
        /** func165_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func165_in_inv_sel:1;
        /** sig165_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig165_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func165_in_sel_cfg_reg_t;

/** Type of func166_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func166_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func166_in_sel:6;
        /** func166_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func166_in_inv_sel:1;
        /** sig166_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig166_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func166_in_sel_cfg_reg_t;

/** Type of func167_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func167_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func167_in_sel:6;
        /** func167_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func167_in_inv_sel:1;
        /** sig167_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig167_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func167_in_sel_cfg_reg_t;

/** Type of func168_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func168_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func168_in_sel:6;
        /** func168_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func168_in_inv_sel:1;
        /** sig168_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig168_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func168_in_sel_cfg_reg_t;

/** Type of func169_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func169_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func169_in_sel:6;
        /** func169_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func169_in_inv_sel:1;
        /** sig169_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig169_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func169_in_sel_cfg_reg_t;

/** Type of func170_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func170_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func170_in_sel:6;
        /** func170_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func170_in_inv_sel:1;
        /** sig170_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig170_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func170_in_sel_cfg_reg_t;

/** Type of func171_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func171_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func171_in_sel:6;
        /** func171_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func171_in_inv_sel:1;
        /** sig171_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig171_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func171_in_sel_cfg_reg_t;

