espressif/esp-idf/components/soc/esp32p4/include/soc/gpio_struct.h
/** Type of func172_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func172_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func172_in_sel:6;
        /** func172_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func172_in_inv_sel:1;
        /** sig172_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig172_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func172_in_sel_cfg_reg_t;

/** Type of func173_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func173_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func173_in_sel:6;
        /** func173_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func173_in_inv_sel:1;
        /** sig173_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig173_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func173_in_sel_cfg_reg_t;

/** Type of func174_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func174_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func174_in_sel:6;
        /** func174_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func174_in_inv_sel:1;
        /** sig174_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig174_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func174_in_sel_cfg_reg_t;

/** Type of func175_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func175_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func175_in_sel:6;
        /** func175_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func175_in_inv_sel:1;
        /** sig175_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig175_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func175_in_sel_cfg_reg_t;

/** Type of func176_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func176_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func176_in_sel:6;
        /** func176_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func176_in_inv_sel:1;
        /** sig176_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig176_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func176_in_sel_cfg_reg_t;

/** Type of func177_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func177_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func177_in_sel:6;
        /** func177_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func177_in_inv_sel:1;
        /** sig177_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig177_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func177_in_sel_cfg_reg_t;

/** Type of func178_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func178_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func178_in_sel:6;
        /** func178_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func178_in_inv_sel:1;
        /** sig178_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig178_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func178_in_sel_cfg_reg_t;

/** Type of func179_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func179_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func179_in_sel:6;
        /** func179_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func179_in_inv_sel:1;
        /** sig179_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig179_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func179_in_sel_cfg_reg_t;

/** Type of func180_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func180_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func180_in_sel:6;
        /** func180_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func180_in_inv_sel:1;
        /** sig180_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig180_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func180_in_sel_cfg_reg_t;

/** Type of func181_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func181_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func181_in_sel:6;
        /** func181_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func181_in_inv_sel:1;
        /** sig181_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig181_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func181_in_sel_cfg_reg_t;

