espressif/esp-idf/components/soc/esp32p4/include/soc/gpio_struct.h
/** Type of func182_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func182_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func182_in_sel:6;
        /** func182_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func182_in_inv_sel:1;
        /** sig182_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig182_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func182_in_sel_cfg_reg_t;

/** Type of func183_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func183_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func183_in_sel:6;
        /** func183_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func183_in_inv_sel:1;
        /** sig183_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig183_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func183_in_sel_cfg_reg_t;

/** Type of func184_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func184_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func184_in_sel:6;
        /** func184_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func184_in_inv_sel:1;
        /** sig184_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig184_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func184_in_sel_cfg_reg_t;

/** Type of func185_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func185_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func185_in_sel:6;
        /** func185_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func185_in_inv_sel:1;
        /** sig185_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig185_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func185_in_sel_cfg_reg_t;

/** Type of func186_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func186_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func186_in_sel:6;
        /** func186_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func186_in_inv_sel:1;
        /** sig186_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig186_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func186_in_sel_cfg_reg_t;

/** Type of func187_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func187_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func187_in_sel:6;
        /** func187_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func187_in_inv_sel:1;
        /** sig187_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig187_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func187_in_sel_cfg_reg_t;

/** Type of func188_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func188_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func188_in_sel:6;
        /** func188_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func188_in_inv_sel:1;
        /** sig188_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig188_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func188_in_sel_cfg_reg_t;

/** Type of func189_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func189_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func189_in_sel:6;
        /** func189_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func189_in_inv_sel:1;
        /** sig189_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig189_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func189_in_sel_cfg_reg_t;

/** Type of func190_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func190_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func190_in_sel:6;
        /** func190_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func190_in_inv_sel:1;
        /** sig190_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig190_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func190_in_sel_cfg_reg_t;

/** Type of func191_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func191_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func191_in_sel:6;
        /** func191_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func191_in_inv_sel:1;
        /** sig191_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig191_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func191_in_sel_cfg_reg_t;

