espressif/esp-idf/components/soc/esp32p4/include/soc/gpio_struct.h
/** Type of func192_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func192_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func192_in_sel:6;
        /** func192_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func192_in_inv_sel:1;
        /** sig192_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig192_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func192_in_sel_cfg_reg_t;

/** Type of func193_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func193_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func193_in_sel:6;
        /** func193_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func193_in_inv_sel:1;
        /** sig193_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig193_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func193_in_sel_cfg_reg_t;

/** Type of func194_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func194_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func194_in_sel:6;
        /** func194_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func194_in_inv_sel:1;
        /** sig194_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig194_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func194_in_sel_cfg_reg_t;

/** Type of func195_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func195_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func195_in_sel:6;
        /** func195_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func195_in_inv_sel:1;
        /** sig195_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig195_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func195_in_sel_cfg_reg_t;

/** Type of func196_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func196_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func196_in_sel:6;
        /** func196_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func196_in_inv_sel:1;
        /** sig196_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig196_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func196_in_sel_cfg_reg_t;

/** Type of func197_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func197_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func197_in_sel:6;
        /** func197_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func197_in_inv_sel:1;
        /** sig197_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig197_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func197_in_sel_cfg_reg_t;

/** Type of func198_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func198_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func198_in_sel:6;
        /** func198_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func198_in_inv_sel:1;
        /** sig198_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig198_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func198_in_sel_cfg_reg_t;

/** Type of func199_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func199_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func199_in_sel:6;
        /** func199_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func199_in_inv_sel:1;
        /** sig199_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig199_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func199_in_sel_cfg_reg_t;

