espressif/esp-idf/components/soc/esp32p4/include/soc/gpio_struct.h
/** Type of func200_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func200_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func200_in_sel:6;
        /** func200_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func200_in_inv_sel:1;
        /** sig200_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig200_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func200_in_sel_cfg_reg_t;

/** Type of func201_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func201_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func201_in_sel:6;
        /** func201_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func201_in_inv_sel:1;
        /** sig201_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig201_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func201_in_sel_cfg_reg_t;

/** Type of func202_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func202_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func202_in_sel:6;
        /** func202_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func202_in_inv_sel:1;
        /** sig202_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig202_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func202_in_sel_cfg_reg_t;

/** Type of func203_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func203_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func203_in_sel:6;
        /** func203_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func203_in_inv_sel:1;
        /** sig203_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig203_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func203_in_sel_cfg_reg_t;

/** Type of func214_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func214_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func214_in_sel:6;
        /** func214_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func214_in_inv_sel:1;
        /** sig214_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig214_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func214_in_sel_cfg_reg_t;

/** Type of func215_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func215_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func215_in_sel:6;
        /** func215_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func215_in_inv_sel:1;
        /** sig215_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig215_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func215_in_sel_cfg_reg_t;

/** Type of func216_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func216_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func216_in_sel:6;
        /** func216_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func216_in_inv_sel:1;
        /** sig216_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig216_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func216_in_sel_cfg_reg_t;

/** Type of func217_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func217_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func217_in_sel:6;
        /** func217_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func217_in_inv_sel:1;
        /** sig217_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig217_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func217_in_sel_cfg_reg_t;

/** Type of func218_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func218_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func218_in_sel:6;
        /** func218_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func218_in_inv_sel:1;
        /** sig218_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig218_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func218_in_sel_cfg_reg_t;

