espressif/esp-idf/components/soc/esp32p4/include/soc/gpio_struct.h
/** Type of func219_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func219_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func219_in_sel:6;
        /** func219_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func219_in_inv_sel:1;
        /** sig219_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig219_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func219_in_sel_cfg_reg_t;

/** Type of func220_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func220_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func220_in_sel:6;
        /** func220_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func220_in_inv_sel:1;
        /** sig220_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig220_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func220_in_sel_cfg_reg_t;

/** Type of func221_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func221_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func221_in_sel:6;
        /** func221_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func221_in_inv_sel:1;
        /** sig221_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig221_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func221_in_sel_cfg_reg_t;

/** Type of func222_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func222_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func222_in_sel:6;
        /** func222_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func222_in_inv_sel:1;
        /** sig222_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig222_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func222_in_sel_cfg_reg_t;

/** Type of func223_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func223_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func223_in_sel:6;
        /** func223_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func223_in_inv_sel:1;
        /** sig223_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig223_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func223_in_sel_cfg_reg_t;

/** Type of func224_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func224_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func224_in_sel:6;
        /** func224_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func224_in_inv_sel:1;
        /** sig224_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig224_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func224_in_sel_cfg_reg_t;

/** Type of func225_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func225_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func225_in_sel:6;
        /** func225_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func225_in_inv_sel:1;
        /** sig225_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig225_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func225_in_sel_cfg_reg_t;

/** Type of func226_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func226_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func226_in_sel:6;
        /** func226_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func226_in_inv_sel:1;
        /** sig226_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig226_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func226_in_sel_cfg_reg_t;

