espressif/esp-idf/components/soc/esp32p4/include/soc/gpio_struct.h
/** Type of func227_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func227_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func227_in_sel:6;
        /** func227_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func227_in_inv_sel:1;
        /** sig227_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig227_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func227_in_sel_cfg_reg_t;

/** Type of func228_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func228_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func228_in_sel:6;
        /** func228_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func228_in_inv_sel:1;
        /** sig228_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig228_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func228_in_sel_cfg_reg_t;

/** Type of func229_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func229_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func229_in_sel:6;
        /** func229_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func229_in_inv_sel:1;
        /** sig229_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig229_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func229_in_sel_cfg_reg_t;

/** Type of func230_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func230_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func230_in_sel:6;
        /** func230_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func230_in_inv_sel:1;
        /** sig230_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig230_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func230_in_sel_cfg_reg_t;

/** Type of func231_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func231_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func231_in_sel:6;
        /** func231_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func231_in_inv_sel:1;
        /** sig231_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig231_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func231_in_sel_cfg_reg_t;

/** Type of func232_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func232_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func232_in_sel:6;
        /** func232_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func232_in_inv_sel:1;
        /** sig232_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig232_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func232_in_sel_cfg_reg_t;

/** Type of func233_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func233_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func233_in_sel:6;
        /** func233_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func233_in_inv_sel:1;
        /** sig233_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig233_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func233_in_sel_cfg_reg_t;

/** Type of func234_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func234_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func234_in_sel:6;
        /** func234_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func234_in_inv_sel:1;
        /** sig234_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig234_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func234_in_sel_cfg_reg_t;

/** Type of func235_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func235_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func235_in_sel:6;
        /** func235_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func235_in_inv_sel:1;
        /** sig235_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig235_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func235_in_sel_cfg_reg_t;

/** Type of func236_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func236_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func236_in_sel:6;
        /** func236_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func236_in_inv_sel:1;
        /** sig236_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig236_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func236_in_sel_cfg_reg_t;

