espressif/esp-idf/components/soc/esp32p4/include/soc/gpio_struct.h
/** Type of func237_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func237_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func237_in_sel:6;
        /** func237_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func237_in_inv_sel:1;
        /** sig237_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig237_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func237_in_sel_cfg_reg_t;

/** Type of func238_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func238_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func238_in_sel:6;
        /** func238_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func238_in_inv_sel:1;
        /** sig238_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig238_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func238_in_sel_cfg_reg_t;

/** Type of func239_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func239_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func239_in_sel:6;
        /** func239_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func239_in_inv_sel:1;
        /** sig239_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig239_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func239_in_sel_cfg_reg_t;

/** Type of func240_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func240_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func240_in_sel:6;
        /** func240_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func240_in_inv_sel:1;
        /** sig240_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig240_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func240_in_sel_cfg_reg_t;

/** Type of func241_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func241_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func241_in_sel:6;
        /** func241_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func241_in_inv_sel:1;
        /** sig241_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig241_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func241_in_sel_cfg_reg_t;

/** Type of func242_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func242_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func242_in_sel:6;
        /** func242_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func242_in_inv_sel:1;
        /** sig242_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig242_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func242_in_sel_cfg_reg_t;

/** Type of func243_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func243_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func243_in_sel:6;
        /** func243_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func243_in_inv_sel:1;
        /** sig243_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig243_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func243_in_sel_cfg_reg_t;

/** Type of func244_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func244_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func244_in_sel:6;
        /** func244_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func244_in_inv_sel:1;
        /** sig244_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig244_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func244_in_sel_cfg_reg_t;

/** Type of func245_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func245_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func245_in_sel:6;
        /** func245_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func245_in_inv_sel:1;
        /** sig245_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig245_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func245_in_sel_cfg_reg_t;

/** Type of func246_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func246_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func246_in_sel:6;
        /** func246_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func246_in_inv_sel:1;
        /** sig246_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig246_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func246_in_sel_cfg_reg_t;

