espressif/esp-idf/components/soc/esp32p4/include/soc/gpio_struct.h
/** Type of func247_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func247_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func247_in_sel:6;
        /** func247_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func247_in_inv_sel:1;
        /** sig247_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig247_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func247_in_sel_cfg_reg_t;

/** Type of func248_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func248_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func248_in_sel:6;
        /** func248_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func248_in_inv_sel:1;
        /** sig248_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig248_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func248_in_sel_cfg_reg_t;

/** Type of func249_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func249_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func249_in_sel:6;
        /** func249_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func249_in_inv_sel:1;
        /** sig249_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig249_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func249_in_sel_cfg_reg_t;

/** Type of func250_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func250_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func250_in_sel:6;
        /** func250_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func250_in_inv_sel:1;
        /** sig250_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig250_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func250_in_sel_cfg_reg_t;

/** Type of func251_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func251_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func251_in_sel:6;
        /** func251_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func251_in_inv_sel:1;
        /** sig251_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig251_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func251_in_sel_cfg_reg_t;

/** Type of func252_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func252_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func252_in_sel:6;
        /** func252_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func252_in_inv_sel:1;
        /** sig252_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig252_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func252_in_sel_cfg_reg_t;

/** Type of func253_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func253_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func253_in_sel:6;
        /** func253_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func253_in_inv_sel:1;
        /** sig253_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig253_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func253_in_sel_cfg_reg_t;

/** Type of func254_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func254_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func254_in_sel:6;
        /** func254_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func254_in_inv_sel:1;
        /** sig254_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig254_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func254_in_sel_cfg_reg_t;

/** Type of func255_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func255_in_sel : R/W; bitpos: [5:0]; default: 62;
         *  set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always
         *  high level. s=0x3E: set this port always low level.
         */
        uint32_t func255_in_sel:6;
        /** func255_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func255_in_inv_sel:1;
        /** sig255_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig255_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func255_in_sel_cfg_reg_t;

/** Type of funcn_out_sel_cfg register
 *  GPIO output function select register
 */
typedef union {
    struct {
        /** funcn_out_sel : R/W/SC; bitpos: [8:0]; default: 256;
         *  The value of the bits: 0<=s<=256. Set the value to select output signal. s=0-255:
         *  output of GPIO[n] equals input of peripheral[s]. s=256: output of GPIO[n] equals
         *  GPIO_OUT_REG[n].
         */
        uint32_t funcn_out_sel:9;
        /** funcn_out_inv_sel : R/W/SC; bitpos: [9]; default: 0;
         *  set this bit to invert output signal.1:invert.0:not invert.
         */
        uint32_t funcn_out_inv_sel:1;
        /** funcn_oen_sel : R/W; bitpos: [10]; default: 0;
         *  set this bit to select output enable signal.1:use GPIO_ENABLE_REG[n] as output
         *  enable signal.0:use peripheral output enable signal.
         */
        uint32_t funcn_oen_sel:1;
        /** funcn_oen_inv_sel : R/W; bitpos: [11]; default: 0;
         *  set this bit to invert output enable signal.1:invert.0:not invert.
         */
        uint32_t funcn_oen_inv_sel:1;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} gpio_funcn_out_sel_cfg_reg_t;

