espressif/esp-idf/components/soc/esp32p4/include/soc/gpio_struct.h
/** Type of intr_2 register
 *  GPIO interrupt 2 status register for GPIO0-31
 */
typedef union {
    struct {
        /** int_2 : RO; bitpos: [31:0]; default: 0;
         *  GPIO interrupt 2 status register for GPIO0-31
         */
        uint32_t int_2:32;
    };
    uint32_t val;
} gpio_intr_2_reg_t;

/** Type of intr1_2 register
 *  GPIO interrupt 2 status register for GPIO32-56
 */
typedef union {
    struct {
        /** int1_2 : RO; bitpos: [24:0]; default: 0;
         *  GPIO interrupt 2 status register for GPIO32-56
         */
        uint32_t int1_2:25;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} gpio_intr1_2_reg_t;

/** Type of intr_3 register
 *  GPIO interrupt 3 status register for GPIO0-31
 */
typedef union {
    struct {
        /** int_3 : RO; bitpos: [31:0]; default: 0;
         *  GPIO interrupt 3 status register for GPIO0-31
         */
        uint32_t int_3:32;
    };
    uint32_t val;
} gpio_intr_3_reg_t;

/** Type of intr1_3 register
 *  GPIO interrupt 3 status register for GPIO32-56
 */
typedef union {
    struct {
        /** int1_3 : RO; bitpos: [24:0]; default: 0;
         *  GPIO interrupt 3 status register for GPIO32-56
         */
        uint32_t int1_3:25;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} gpio_intr1_3_reg_t;

/** Type of clock_gate register
 *  GPIO clock gate register
 */
typedef union {
    struct {
        /** clk_en : R/W; bitpos: [0]; default: 1;
         *  set this bit to enable GPIO clock gate
         */
        uint32_t clk_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} gpio_clock_gate_reg_t;

/** Type of zero_det0_filter_cnt register
 *  GPIO analog comparator zero detect filter count
 */
typedef union {
    struct {
        /** zero_det0_filter_cnt : R/W; bitpos: [31:0]; default: 4294967295;
         *  GPIO analog comparator zero detect filter count
         */
        uint32_t zero_det0_filter_cnt:32;
    };
    uint32_t val;
} gpio_zero_det0_filter_cnt_reg_t;

/** Type of zero_det1_filter_cnt register
 *  GPIO analog comparator zero detect filter count
 */
typedef union {
    struct {
        /** zero_det1_filter_cnt : R/W; bitpos: [31:0]; default: 4294967295;
         *  GPIO analog comparator zero detect filter count
         */
        uint32_t zero_det1_filter_cnt:32;
    };
    uint32_t val;
} gpio_zero_det1_filter_cnt_reg_t;

/** Type of send_seq register
 *  High speed sdio pad bist send sequence
 */
typedef union {
    struct {
        /** send_seq : R/W; bitpos: [31:0]; default: 305419896;
         *  High speed sdio pad bist send sequence
         */
        uint32_t send_seq:32;
    };
    uint32_t val;
} gpio_send_seq_reg_t;

/** Type of recive_seq register
 *  High speed sdio pad bist recive sequence
 */
typedef union {
    struct {
        /** recive_seq : RO; bitpos: [31:0]; default: 0;
         *  High speed sdio pad bist recive sequence
         */
        uint32_t recive_seq:32;
    };
    uint32_t val;
} gpio_recive_seq_reg_t;

/** Type of bistin_sel register
 *  High speed sdio pad bist in pad sel
 */
typedef union {
    struct {
        /** bistin_sel : R/W; bitpos: [3:0]; default: 15;
         *  High speed sdio pad bist in pad sel 0:pad39, 1: pad40...
         */
        uint32_t bistin_sel:4;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} gpio_bistin_sel_reg_t;

/** Type of bist_ctrl register
 *  High speed sdio pad bist control
 */
typedef union {
    struct {
        /** bist_pad_oe : R/W; bitpos: [0]; default: 1;
         *  High speed sdio pad bist out pad oe
         */
        uint32_t bist_pad_oe:1;
        /** bist_start : WT; bitpos: [1]; default: 0;
         *  High speed sdio pad bist start
         */
        uint32_t bist_start:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} gpio_bist_ctrl_reg_t;

/** Type of date register
 *  GPIO version register
 */
typedef union {
    struct {
        /** date : R/W; bitpos: [27:0]; default: 2294787;
         *  version register
         */
        uint32_t date:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} gpio_date_reg_t;


/** Group: GPIO INT RAW REG */
/** Type of int_raw register
 *  analog comparator interrupt raw
 */
typedef union {
    struct {
        /** comp0_neg_int_raw : R/WTC/SS; bitpos: [0]; default: 0;
         *  analog comparator pos edge interrupt raw
         */
        uint32_t comp0_neg_int_raw:1;
        /** comp0_pos_int_raw : R/WTC/SS; bitpos: [1]; default: 0;
         *  analog comparator neg edge interrupt raw
         */
        uint32_t comp0_pos_int_raw:1;
        /** comp0_all_int_raw : R/WTC/SS; bitpos: [2]; default: 0;
         *  analog comparator neg or pos edge interrupt raw
         */
        uint32_t comp0_all_int_raw:1;
        /** comp1_neg_int_raw : R/WTC/SS; bitpos: [3]; default: 0;
         *  analog comparator pos edge interrupt raw
         */
        uint32_t comp1_neg_int_raw:1;
        /** comp1_pos_int_raw : R/WTC/SS; bitpos: [4]; default: 0;
         *  analog comparator neg edge interrupt raw
         */
        uint32_t comp1_pos_int_raw:1;
        /** comp1_all_int_raw : R/WTC/SS; bitpos: [5]; default: 0;
         *  analog comparator neg or pos edge interrupt raw
         */
        uint32_t comp1_all_int_raw:1;
        /** bistok_int_raw : R/WTC/SS; bitpos: [6]; default: 0;
         *  pad bistok interrupt raw
         */
        uint32_t bistok_int_raw:1;
        /** bistfail_int_raw : R/WTC/SS; bitpos: [7]; default: 0;
         *  pad bistfail interrupt raw
         */
        uint32_t bistfail_int_raw:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_int_raw_reg_t;


/** Group: GPIO INT ST REG */
/** Type of int_st register
 *  analog comparator interrupt status
 */
typedef union {
    struct {
        /** comp0_neg_int_st : RO; bitpos: [0]; default: 0;
         *  analog comparator pos edge interrupt status
         */
        uint32_t comp0_neg_int_st:1;
        /** comp0_pos_int_st : RO; bitpos: [1]; default: 0;
         *  analog comparator neg edge interrupt status
         */
        uint32_t comp0_pos_int_st:1;
        /** comp0_all_int_st : RO; bitpos: [2]; default: 0;
         *  analog comparator neg or pos edge interrupt status
         */
        uint32_t comp0_all_int_st:1;
        /** comp1_neg_int_st : RO; bitpos: [3]; default: 0;
         *  analog comparator pos edge interrupt status
         */
        uint32_t comp1_neg_int_st:1;
        /** comp1_pos_int_st : RO; bitpos: [4]; default: 0;
         *  analog comparator neg edge interrupt status
         */
        uint32_t comp1_pos_int_st:1;
        /** comp1_all_int_st : RO; bitpos: [5]; default: 0;
         *  analog comparator neg or pos edge interrupt status
         */
        uint32_t comp1_all_int_st:1;
        /** bistok_int_st : RO; bitpos: [6]; default: 0;
         *  pad bistok interrupt status
         */
        uint32_t bistok_int_st:1;
        /** bistfail_int_st : RO; bitpos: [7]; default: 0;
         *  pad bistfail interrupt status
         */
        uint32_t bistfail_int_st:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_int_st_reg_t;


/** Group: GPIO INT ENA REG */
/** Type of int_ena register
 *  analog comparator interrupt enable
 */
typedef union {
    struct {
        /** comp0_neg_int_ena : R/W; bitpos: [0]; default: 1;
         *  analog comparator pos edge interrupt enable
         */
        uint32_t comp0_neg_int_ena:1;
        /** comp0_pos_int_ena : R/W; bitpos: [1]; default: 1;
         *  analog comparator neg edge interrupt enable
         */
        uint32_t comp0_pos_int_ena:1;
        /** comp0_all_int_ena : R/W; bitpos: [2]; default: 1;
         *  analog comparator neg or pos edge interrupt enable
         */
        uint32_t comp0_all_int_ena:1;
        /** comp1_neg_int_ena : R/W; bitpos: [3]; default: 1;
         *  analog comparator pos edge interrupt enable
         */
        uint32_t comp1_neg_int_ena:1;
        /** comp1_pos_int_ena : R/W; bitpos: [4]; default: 1;
         *  analog comparator neg edge interrupt enable
         */
        uint32_t comp1_pos_int_ena:1;
        /** comp1_all_int_ena : R/W; bitpos: [5]; default: 1;
         *  analog comparator neg or pos edge interrupt enable
         */
        uint32_t comp1_all_int_ena:1;
        /** bistok_int_ena : R/W; bitpos: [6]; default: 1;
         *  pad bistok interrupt enable
         */
        uint32_t bistok_int_ena:1;
        /** bistfail_int_ena : R/W; bitpos: [7]; default: 1;
         *  pad bistfail interrupt enable
         */
        uint32_t bistfail_int_ena:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_int_ena_reg_t;


/** Group: GPIO INT CLR REG */
/** Type of int_clr register
 *  analog comparator interrupt clear
 */
typedef union {
    struct {
        /** comp0_neg_int_clr : WT; bitpos: [0]; default: 0;
         *  analog comparator pos edge interrupt clear
         */
        uint32_t comp0_neg_int_clr:1;
        /** comp0_pos_int_clr : WT; bitpos: [1]; default: 0;
         *  analog comparator neg edge interrupt clear
         */
        uint32_t comp0_pos_int_clr:1;
        /** comp0_all_int_clr : WT; bitpos: [2]; default: 0;
         *  analog comparator neg or pos edge interrupt clear
         */
        uint32_t comp0_all_int_clr:1;
        /** comp1_neg_int_clr : WT; bitpos: [3]; default: 0;
         *  analog comparator pos edge interrupt clear
         */
        uint32_t comp1_neg_int_clr:1;
        /** comp1_pos_int_clr : WT; bitpos: [4]; default: 0;
         *  analog comparator neg edge interrupt clear
         */
        uint32_t comp1_pos_int_clr:1;
        /** comp1_all_int_clr : WT; bitpos: [5]; default: 0;
         *  analog comparator neg or pos edge interrupt clear
         */
        uint32_t comp1_all_int_clr:1;
        /** bistok_int_clr : WT; bitpos: [6]; default: 0;
         *  pad bistok interrupt enable
         */
        uint32_t bistok_int_clr:1;
        /** bistfail_int_clr : WT; bitpos: [7]; default: 0;
         *  pad bistfail interrupt enable
         */
        uint32_t bistfail_int_clr:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_int_clr_reg_t;


