espressif/esp-idf/components/soc/esp32p4/include/soc/gpio_struct.h
typedef struct {
    volatile gpio_bt_select_reg_t bt_select;
    volatile gpio_out_reg_t out;
    volatile gpio_out_w1ts_reg_t out_w1ts;
    volatile gpio_out_w1tc_reg_t out_w1tc;
    volatile gpio_out1_reg_t out1;
    volatile gpio_out1_w1ts_reg_t out1_w1ts;
    volatile gpio_out1_w1tc_reg_t out1_w1tc;
    uint32_t reserved_01c;
    volatile gpio_enable_reg_t enable;
    volatile gpio_enable_w1ts_reg_t enable_w1ts;
    volatile gpio_enable_w1tc_reg_t enable_w1tc;
    volatile gpio_enable1_reg_t enable1;
    volatile gpio_enable1_w1ts_reg_t enable1_w1ts;
    volatile gpio_enable1_w1tc_reg_t enable1_w1tc;
    volatile gpio_strap_reg_t strap;
    volatile gpio_in_reg_t in;
    volatile gpio_in1_reg_t in1;
    volatile gpio_status_reg_t status;
    volatile gpio_status_w1ts_reg_t status_w1ts;
    volatile gpio_status_w1tc_reg_t status_w1tc;
    volatile gpio_status1_reg_t status1;
    volatile gpio_status1_w1ts_reg_t status1_w1ts;
    volatile gpio_status1_w1tc_reg_t status1_w1tc;
    volatile gpio_intr_0_reg_t intr_0;
    volatile gpio_intr1_0_reg_t intr1_0;
    volatile gpio_intr_1_reg_t intr_1;
    volatile gpio_intr1_1_reg_t intr1_1;
    volatile gpio_status_next_reg_t status_next;
    volatile gpio_status_next1_reg_t status_next1;
    volatile gpio_pinn_reg_t pinn[57];
    uint32_t reserved_158;
    volatile gpio_func1_in_sel_cfg_reg_t func1_in_sel_cfg;
    volatile gpio_func2_in_sel_cfg_reg_t func2_in_sel_cfg;
    volatile gpio_func3_in_sel_cfg_reg_t func3_in_sel_cfg;
    volatile gpio_func4_in_sel_cfg_reg_t func4_in_sel_cfg;
    volatile gpio_func5_in_sel_cfg_reg_t func5_in_sel_cfg;
    volatile gpio_func6_in_sel_cfg_reg_t func6_in_sel_cfg;
    volatile gpio_func7_in_sel_cfg_reg_t func7_in_sel_cfg;
    volatile gpio_func8_in_sel_cfg_reg_t func8_in_sel_cfg;
    volatile gpio_func9_in_sel_cfg_reg_t func9_in_sel_cfg;
    volatile gpio_func10_in_sel_cfg_reg_t func10_in_sel_cfg;
    volatile gpio_func11_in_sel_cfg_reg_t func11_in_sel_cfg;
    volatile gpio_func12_in_sel_cfg_reg_t func12_in_sel_cfg;
    volatile gpio_func13_in_sel_cfg_reg_t func13_in_sel_cfg;
    volatile gpio_func14_in_sel_cfg_reg_t func14_in_sel_cfg;
    volatile gpio_func15_in_sel_cfg_reg_t func15_in_sel_cfg;
    volatile gpio_func16_in_sel_cfg_reg_t func16_in_sel_cfg;
    volatile gpio_func17_in_sel_cfg_reg_t func17_in_sel_cfg;
    volatile gpio_func18_in_sel_cfg_reg_t func18_in_sel_cfg;
    volatile gpio_func19_in_sel_cfg_reg_t func19_in_sel_cfg;
    volatile gpio_func20_in_sel_cfg_reg_t func20_in_sel_cfg;
    volatile gpio_func21_in_sel_cfg_reg_t func21_in_sel_cfg;
    volatile gpio_func22_in_sel_cfg_reg_t func22_in_sel_cfg;
    volatile gpio_func23_in_sel_cfg_reg_t func23_in_sel_cfg;
    volatile gpio_func24_in_sel_cfg_reg_t func24_in_sel_cfg;
    volatile gpio_func25_in_sel_cfg_reg_t func25_in_sel_cfg;
    volatile gpio_func26_in_sel_cfg_reg_t func26_in_sel_cfg;
    volatile gpio_func27_in_sel_cfg_reg_t func27_in_sel_cfg;
    volatile gpio_func28_in_sel_cfg_reg_t func28_in_sel_cfg;
    volatile gpio_func29_in_sel_cfg_reg_t func29_in_sel_cfg;
    volatile gpio_func30_in_sel_cfg_reg_t func30_in_sel_cfg;
    volatile gpio_func31_in_sel_cfg_reg_t func31_in_sel_cfg;
    volatile gpio_func32_in_sel_cfg_reg_t func32_in_sel_cfg;
    volatile gpio_func33_in_sel_cfg_reg_t func33_in_sel_cfg;
    volatile gpio_func34_in_sel_cfg_reg_t func34_in_sel_cfg;
    volatile gpio_func35_in_sel_cfg_reg_t func35_in_sel_cfg;
    volatile gpio_func36_in_sel_cfg_reg_t func36_in_sel_cfg;
    volatile gpio_func37_in_sel_cfg_reg_t func37_in_sel_cfg;
    volatile gpio_func38_in_sel_cfg_reg_t func38_in_sel_cfg;
    volatile gpio_func39_in_sel_cfg_reg_t func39_in_sel_cfg;
    volatile gpio_func40_in_sel_cfg_reg_t func40_in_sel_cfg;
    volatile gpio_func41_in_sel_cfg_reg_t func41_in_sel_cfg;
    volatile gpio_func42_in_sel_cfg_reg_t func42_in_sel_cfg;
    volatile gpio_func43_in_sel_cfg_reg_t func43_in_sel_cfg;
    volatile gpio_func44_in_sel_cfg_reg_t func44_in_sel_cfg;
    volatile gpio_func45_in_sel_cfg_reg_t func45_in_sel_cfg;
    uint32_t reserved_210;
    volatile gpio_func47_in_sel_cfg_reg_t func47_in_sel_cfg;
    volatile gpio_func48_in_sel_cfg_reg_t func48_in_sel_cfg;
    volatile gpio_func49_in_sel_cfg_reg_t func49_in_sel_cfg;
    volatile gpio_func50_in_sel_cfg_reg_t func50_in_sel_cfg;
    volatile gpio_func51_in_sel_cfg_reg_t func51_in_sel_cfg;
    volatile gpio_func52_in_sel_cfg_reg_t func52_in_sel_cfg;
    volatile gpio_func53_in_sel_cfg_reg_t func53_in_sel_cfg;
    volatile gpio_func54_in_sel_cfg_reg_t func54_in_sel_cfg;
    volatile gpio_func55_in_sel_cfg_reg_t func55_in_sel_cfg;
    volatile gpio_func56_in_sel_cfg_reg_t func56_in_sel_cfg;
    volatile gpio_func57_in_sel_cfg_reg_t func57_in_sel_cfg;
    volatile gpio_func58_in_sel_cfg_reg_t func58_in_sel_cfg;
    volatile gpio_func59_in_sel_cfg_reg_t func59_in_sel_cfg;
    volatile gpio_func60_in_sel_cfg_reg_t func60_in_sel_cfg;
    volatile gpio_func61_in_sel_cfg_reg_t func61_in_sel_cfg;
    volatile gpio_func62_in_sel_cfg_reg_t func62_in_sel_cfg;
    volatile gpio_func63_in_sel_cfg_reg_t func63_in_sel_cfg;
    volatile gpio_func64_in_sel_cfg_reg_t func64_in_sel_cfg;
    volatile gpio_func65_in_sel_cfg_reg_t func65_in_sel_cfg;
    volatile gpio_func66_in_sel_cfg_reg_t func66_in_sel_cfg;
    uint32_t reserved_264;
    volatile gpio_func68_in_sel_cfg_reg_t func68_in_sel_cfg;
    volatile gpio_func69_in_sel_cfg_reg_t func69_in_sel_cfg;
    volatile gpio_func70_in_sel_cfg_reg_t func70_in_sel_cfg;
    volatile gpio_func71_in_sel_cfg_reg_t func71_in_sel_cfg;
    uint32_t reserved_278[2];
    volatile gpio_func74_in_sel_cfg_reg_t func74_in_sel_cfg;
    volatile gpio_func75_in_sel_cfg_reg_t func75_in_sel_cfg;
    volatile gpio_func76_in_sel_cfg_reg_t func76_in_sel_cfg;
    volatile gpio_func77_in_sel_cfg_reg_t func77_in_sel_cfg;
    volatile gpio_func78_in_sel_cfg_reg_t func78_in_sel_cfg;
    uint32_t reserved_294;
    volatile gpio_func80_in_sel_cfg_reg_t func80_in_sel_cfg;
    uint32_t reserved_29c[2];
    volatile gpio_func83_in_sel_cfg_reg_t func83_in_sel_cfg;
    uint32_t reserved_2a8[2];
    volatile gpio_func86_in_sel_cfg_reg_t func86_in_sel_cfg;
    uint32_t reserved_2b4[2];
    volatile gpio_func89_in_sel_cfg_reg_t func89_in_sel_cfg;
    volatile gpio_func90_in_sel_cfg_reg_t func90_in_sel_cfg;
    volatile gpio_func91_in_sel_cfg_reg_t func91_in_sel_cfg;
    volatile gpio_func92_in_sel_cfg_reg_t func92_in_sel_cfg;
    volatile gpio_func93_in_sel_cfg_reg_t func93_in_sel_cfg;
    volatile gpio_func94_in_sel_cfg_reg_t func94_in_sel_cfg;
    volatile gpio_func95_in_sel_cfg_reg_t func95_in_sel_cfg;
    volatile gpio_func96_in_sel_cfg_reg_t func96_in_sel_cfg;
    volatile gpio_func97_in_sel_cfg_reg_t func97_in_sel_cfg;
    volatile gpio_func98_in_sel_cfg_reg_t func98_in_sel_cfg;
    volatile gpio_func99_in_sel_cfg_reg_t func99_in_sel_cfg;
    volatile gpio_func100_in_sel_cfg_reg_t func100_in_sel_cfg;
    volatile gpio_func101_in_sel_cfg_reg_t func101_in_sel_cfg;
    volatile gpio_func102_in_sel_cfg_reg_t func102_in_sel_cfg;
    volatile gpio_func103_in_sel_cfg_reg_t func103_in_sel_cfg;
    volatile gpio_func104_in_sel_cfg_reg_t func104_in_sel_cfg;
    volatile gpio_func105_in_sel_cfg_reg_t func105_in_sel_cfg;
    volatile gpio_func106_in_sel_cfg_reg_t func106_in_sel_cfg;
    volatile gpio_func107_in_sel_cfg_reg_t func107_in_sel_cfg;
    volatile gpio_func108_in_sel_cfg_reg_t func108_in_sel_cfg;
    volatile gpio_func109_in_sel_cfg_reg_t func109_in_sel_cfg;
    volatile gpio_func110_in_sel_cfg_reg_t func110_in_sel_cfg;
    volatile gpio_func111_in_sel_cfg_reg_t func111_in_sel_cfg;
    volatile gpio_func112_in_sel_cfg_reg_t func112_in_sel_cfg;
    volatile gpio_func113_in_sel_cfg_reg_t func113_in_sel_cfg;
    volatile gpio_func114_in_sel_cfg_reg_t func114_in_sel_cfg;
    uint32_t reserved_324[2];
    volatile gpio_func117_in_sel_cfg_reg_t func117_in_sel_cfg;
    volatile gpio_func118_in_sel_cfg_reg_t func118_in_sel_cfg;
    uint32_t reserved_334[7];
    volatile gpio_func126_in_sel_cfg_reg_t func126_in_sel_cfg;
    volatile gpio_func127_in_sel_cfg_reg_t func127_in_sel_cfg;
    volatile gpio_func128_in_sel_cfg_reg_t func128_in_sel_cfg;
    volatile gpio_func129_in_sel_cfg_reg_t func129_in_sel_cfg;
    volatile gpio_func130_in_sel_cfg_reg_t func130_in_sel_cfg;
    volatile gpio_func131_in_sel_cfg_reg_t func131_in_sel_cfg;
    volatile gpio_func132_in_sel_cfg_reg_t func132_in_sel_cfg;
    volatile gpio_func133_in_sel_cfg_reg_t func133_in_sel_cfg;
    volatile gpio_func134_in_sel_cfg_reg_t func134_in_sel_cfg;
    volatile gpio_func135_in_sel_cfg_reg_t func135_in_sel_cfg;
    volatile gpio_func136_in_sel_cfg_reg_t func136_in_sel_cfg;
    volatile gpio_func137_in_sel_cfg_reg_t func137_in_sel_cfg;
    volatile gpio_func138_in_sel_cfg_reg_t func138_in_sel_cfg;
    volatile gpio_func139_in_sel_cfg_reg_t func139_in_sel_cfg;
    volatile gpio_func140_in_sel_cfg_reg_t func140_in_sel_cfg;
    volatile gpio_func141_in_sel_cfg_reg_t func141_in_sel_cfg;
    volatile gpio_func142_in_sel_cfg_reg_t func142_in_sel_cfg;
    volatile gpio_func143_in_sel_cfg_reg_t func143_in_sel_cfg;
    volatile gpio_func144_in_sel_cfg_reg_t func144_in_sel_cfg;
    volatile gpio_func145_in_sel_cfg_reg_t func145_in_sel_cfg;
    volatile gpio_func146_in_sel_cfg_reg_t func146_in_sel_cfg;
    volatile gpio_func147_in_sel_cfg_reg_t func147_in_sel_cfg;
    volatile gpio_func148_in_sel_cfg_reg_t func148_in_sel_cfg;
    volatile gpio_func149_in_sel_cfg_reg_t func149_in_sel_cfg;
    volatile gpio_func150_in_sel_cfg_reg_t func150_in_sel_cfg;
    volatile gpio_func151_in_sel_cfg_reg_t func151_in_sel_cfg;
    volatile gpio_func152_in_sel_cfg_reg_t func152_in_sel_cfg;
    volatile gpio_func153_in_sel_cfg_reg_t func153_in_sel_cfg;
    volatile gpio_func154_in_sel_cfg_reg_t func154_in_sel_cfg;
    volatile gpio_func155_in_sel_cfg_reg_t func155_in_sel_cfg;
    volatile gpio_func156_in_sel_cfg_reg_t func156_in_sel_cfg;
    uint32_t reserved_3cc;
    volatile gpio_func158_in_sel_cfg_reg_t func158_in_sel_cfg;
    volatile gpio_func159_in_sel_cfg_reg_t func159_in_sel_cfg;
    volatile gpio_func160_in_sel_cfg_reg_t func160_in_sel_cfg;
    volatile gpio_func161_in_sel_cfg_reg_t func161_in_sel_cfg;
    volatile gpio_func162_in_sel_cfg_reg_t func162_in_sel_cfg;
    volatile gpio_func163_in_sel_cfg_reg_t func163_in_sel_cfg;
    volatile gpio_func164_in_sel_cfg_reg_t func164_in_sel_cfg;
    volatile gpio_func165_in_sel_cfg_reg_t func165_in_sel_cfg;
    volatile gpio_func166_in_sel_cfg_reg_t func166_in_sel_cfg;
    volatile gpio_func167_in_sel_cfg_reg_t func167_in_sel_cfg;
    volatile gpio_func168_in_sel_cfg_reg_t func168_in_sel_cfg;
    volatile gpio_func169_in_sel_cfg_reg_t func169_in_sel_cfg;
    volatile gpio_func170_in_sel_cfg_reg_t func170_in_sel_cfg;
    volatile gpio_func171_in_sel_cfg_reg_t func171_in_sel_cfg;
    volatile gpio_func172_in_sel_cfg_reg_t func172_in_sel_cfg;
    volatile gpio_func173_in_sel_cfg_reg_t func173_in_sel_cfg;
    volatile gpio_func174_in_sel_cfg_reg_t func174_in_sel_cfg;
    volatile gpio_func175_in_sel_cfg_reg_t func175_in_sel_cfg;
    volatile gpio_func176_in_sel_cfg_reg_t func176_in_sel_cfg;
    volatile gpio_func177_in_sel_cfg_reg_t func177_in_sel_cfg;
    volatile gpio_func178_in_sel_cfg_reg_t func178_in_sel_cfg;
    volatile gpio_func179_in_sel_cfg_reg_t func179_in_sel_cfg;
    volatile gpio_func180_in_sel_cfg_reg_t func180_in_sel_cfg;
    volatile gpio_func181_in_sel_cfg_reg_t func181_in_sel_cfg;
    volatile gpio_func182_in_sel_cfg_reg_t func182_in_sel_cfg;
    volatile gpio_func183_in_sel_cfg_reg_t func183_in_sel_cfg;
    volatile gpio_func184_in_sel_cfg_reg_t func184_in_sel_cfg;
    volatile gpio_func185_in_sel_cfg_reg_t func185_in_sel_cfg;
    volatile gpio_func186_in_sel_cfg_reg_t func186_in_sel_cfg;
    volatile gpio_func187_in_sel_cfg_reg_t func187_in_sel_cfg;
    volatile gpio_func188_in_sel_cfg_reg_t func188_in_sel_cfg;
    volatile gpio_func189_in_sel_cfg_reg_t func189_in_sel_cfg;
    volatile gpio_func190_in_sel_cfg_reg_t func190_in_sel_cfg;
    volatile gpio_func191_in_sel_cfg_reg_t func191_in_sel_cfg;
    volatile gpio_func192_in_sel_cfg_reg_t func192_in_sel_cfg;
    volatile gpio_func193_in_sel_cfg_reg_t func193_in_sel_cfg;
    volatile gpio_func194_in_sel_cfg_reg_t func194_in_sel_cfg;
    volatile gpio_func195_in_sel_cfg_reg_t func195_in_sel_cfg;
    volatile gpio_func196_in_sel_cfg_reg_t func196_in_sel_cfg;
    volatile gpio_func197_in_sel_cfg_reg_t func197_in_sel_cfg;
    volatile gpio_func198_in_sel_cfg_reg_t func198_in_sel_cfg;
    volatile gpio_func199_in_sel_cfg_reg_t func199_in_sel_cfg;
    volatile gpio_func200_in_sel_cfg_reg_t func200_in_sel_cfg;
    volatile gpio_func201_in_sel_cfg_reg_t func201_in_sel_cfg;
    volatile gpio_func202_in_sel_cfg_reg_t func202_in_sel_cfg;
    volatile gpio_func203_in_sel_cfg_reg_t func203_in_sel_cfg;
    uint32_t reserved_488[10];
    volatile gpio_func214_in_sel_cfg_reg_t func214_in_sel_cfg;
    volatile gpio_func215_in_sel_cfg_reg_t func215_in_sel_cfg;
    volatile gpio_func216_in_sel_cfg_reg_t func216_in_sel_cfg;
    volatile gpio_func217_in_sel_cfg_reg_t func217_in_sel_cfg;
    volatile gpio_func218_in_sel_cfg_reg_t func218_in_sel_cfg;
    volatile gpio_func219_in_sel_cfg_reg_t func219_in_sel_cfg;
    volatile gpio_func220_in_sel_cfg_reg_t func220_in_sel_cfg;
    volatile gpio_func221_in_sel_cfg_reg_t func221_in_sel_cfg;
    volatile gpio_func222_in_sel_cfg_reg_t func222_in_sel_cfg;
    volatile gpio_func223_in_sel_cfg_reg_t func223_in_sel_cfg;
    volatile gpio_func224_in_sel_cfg_reg_t func224_in_sel_cfg;
    volatile gpio_func225_in_sel_cfg_reg_t func225_in_sel_cfg;
    volatile gpio_func226_in_sel_cfg_reg_t func226_in_sel_cfg;
    volatile gpio_func227_in_sel_cfg_reg_t func227_in_sel_cfg;
    volatile gpio_func228_in_sel_cfg_reg_t func228_in_sel_cfg;
    volatile gpio_func229_in_sel_cfg_reg_t func229_in_sel_cfg;
    volatile gpio_func230_in_sel_cfg_reg_t func230_in_sel_cfg;
    volatile gpio_func231_in_sel_cfg_reg_t func231_in_sel_cfg;
    volatile gpio_func232_in_sel_cfg_reg_t func232_in_sel_cfg;
    volatile gpio_func233_in_sel_cfg_reg_t func233_in_sel_cfg;
    volatile gpio_func234_in_sel_cfg_reg_t func234_in_sel_cfg;
    volatile gpio_func235_in_sel_cfg_reg_t func235_in_sel_cfg;
    volatile gpio_func236_in_sel_cfg_reg_t func236_in_sel_cfg;
    volatile gpio_func237_in_sel_cfg_reg_t func237_in_sel_cfg;
    volatile gpio_func238_in_sel_cfg_reg_t func238_in_sel_cfg;
    volatile gpio_func239_in_sel_cfg_reg_t func239_in_sel_cfg;
    volatile gpio_func240_in_sel_cfg_reg_t func240_in_sel_cfg;
    volatile gpio_func241_in_sel_cfg_reg_t func241_in_sel_cfg;
    volatile gpio_func242_in_sel_cfg_reg_t func242_in_sel_cfg;
    volatile gpio_func243_in_sel_cfg_reg_t func243_in_sel_cfg;
    volatile gpio_func244_in_sel_cfg_reg_t func244_in_sel_cfg;
    volatile gpio_func245_in_sel_cfg_reg_t func245_in_sel_cfg;
    volatile gpio_func246_in_sel_cfg_reg_t func246_in_sel_cfg;
    volatile gpio_func247_in_sel_cfg_reg_t func247_in_sel_cfg;
    volatile gpio_func248_in_sel_cfg_reg_t func248_in_sel_cfg;
    volatile gpio_func249_in_sel_cfg_reg_t func249_in_sel_cfg;
    volatile gpio_func250_in_sel_cfg_reg_t func250_in_sel_cfg;
    volatile gpio_func251_in_sel_cfg_reg_t func251_in_sel_cfg;
    volatile gpio_func252_in_sel_cfg_reg_t func252_in_sel_cfg;
    volatile gpio_func253_in_sel_cfg_reg_t func253_in_sel_cfg;
    volatile gpio_func254_in_sel_cfg_reg_t func254_in_sel_cfg;
    volatile gpio_func255_in_sel_cfg_reg_t func255_in_sel_cfg;
    volatile gpio_funcn_out_sel_cfg_reg_t funcn_out_sel_cfg[57];
    volatile gpio_intr_2_reg_t intr_2;
    volatile gpio_intr1_2_reg_t intr1_2;
    volatile gpio_intr_3_reg_t intr_3;
    volatile gpio_intr1_3_reg_t intr1_3;
    volatile gpio_clock_gate_reg_t clock_gate;
    uint32_t reserved_650[44];
    volatile gpio_int_raw_reg_t int_raw;
    volatile gpio_int_st_reg_t int_st;
    volatile gpio_int_ena_reg_t int_ena;
    volatile gpio_int_clr_reg_t int_clr;
    volatile gpio_zero_det0_filter_cnt_reg_t zero_det0_filter_cnt;
    volatile gpio_zero_det1_filter_cnt_reg_t zero_det1_filter_cnt;
    volatile gpio_send_seq_reg_t send_seq;
    volatile gpio_recive_seq_reg_t recive_seq;
    volatile gpio_bistin_sel_reg_t bistin_sel;
    volatile gpio_bist_ctrl_reg_t bist_ctrl;
    uint32_t reserved_728[53];
    volatile gpio_date_reg_t date;
} gpio_dev_t;

extern gpio_dev_t GPIO;

#ifndef __cplusplus
_Static_assert(sizeof(gpio_dev_t) == 0x800, "Invalid size of gpio_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
